"""
[Title/Звание]
TurboNafta
[Description/Обрисовка]

TurboNafta е 2D дрифт състезателна игра, в която двама играчи се състезават на разделен екран,
като всеики играч управлява своя собствена кола. Играчите трябва да следят трасето и да преминават през завоите,
като внимават да не излизат извън него. Когато колата на играч излезе извън пистата, тя се забавя,
което увеличава времето на играча. Печелившият е този, който завърши трасето за
най-кратко време(първият преминал финиш линията).

[Functionalities/Надарености]

1. Разделение на екран между двама играчи: Играта показва два отделни екрана, като всеки играч управлява своя кола.
2. Управление на колата: ускоряват, намаляване и управляват дрифта на колите си. Колите ще имат поведение на дрифт.
3. Забавяне при излизане извън трасето: Когато играч излезе извън трасето, неговата кола се забавя.
4. Система за време: Тракер, който отчита времето на играчите за преминаване на трасето.
5. Множество писти/Multiple Tracks: Разнообразие от трасета с различна трудност.
6. Резултати и класация: Показване на времето на всеки играч, като печелившият е този, който завърши първи.
7. Мултиплейър: Играта се осъществява на един компютър от двама играчи.
(Maybe) 8.Трасета сa s различни препятствия.

[Milestones/Възлови точки]

Настройка на играта
Механика как колата се управлява
Създаване на трасета
Система за време и класация

[Estimate in man-hours/Времеоценка в човекочасове]

Ако не броим целия процес с разучаването на pyGame библиотеката
30 часа

[Usage of technologies/Потребление на технологии]

Мисля да използвам Python като език!
Физика на играта - pyGame
Отброяване на време - pyGame
Звуци при сблъсък и излизане от трасето - pyGame
Цялостно - pyGame :)

"""